espressif/esp-idf/components/soc/esp32h4/register/soc/ledc_reg.h
/** LEDC_CH1_FADE_CONF_REG register
 *  Ledc ch1 fade config register.
 */
#define LEDC_CH1_FADE_CONF_REG (DR_REG_LEDC_BASE + 0x104)
/** LEDC_CH1_FADE_PAUSE : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to pause duty cycle fading of LEDC ch1.
 *  0: Invalid. No effect
 *  1: Pause
 */
#define LEDC_CH1_FADE_PAUSE    (BIT(5))
#define LEDC_CH1_FADE_PAUSE_M  (LEDC_CH1_FADE_PAUSE_V << LEDC_CH1_FADE_PAUSE_S)
#define LEDC_CH1_FADE_PAUSE_V  0x00000001U
#define LEDC_CH1_FADE_PAUSE_S  5
/** LEDC_CH1_FADE_RESUME : WT; bitpos: [6]; default: 0;
 *  Configures whether or nor to resume duty cycle fading of LEDC ch1.
 *  0: Invalid. No effect
 *  1: Resume
 */
#define LEDC_CH1_FADE_RESUME    (BIT(6))
#define LEDC_CH1_FADE_RESUME_M  (LEDC_CH1_FADE_RESUME_V << LEDC_CH1_FADE_RESUME_S)
#define LEDC_CH1_FADE_RESUME_V  0x00000001U
#define LEDC_CH1_FADE_RESUME_S  6

/** LEDC_CH2_FADE_CONF_REG register
 *  Ledc ch2 fade config register.
 */
#define LEDC_CH2_FADE_CONF_REG (DR_REG_LEDC_BASE + 0x108)
/** LEDC_CH2_FADE_PAUSE : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to pause duty cycle fading of LEDC ch2.
 *  0: Invalid. No effect
 *  1: Pause
 */
#define LEDC_CH2_FADE_PAUSE    (BIT(5))
#define LEDC_CH2_FADE_PAUSE_M  (LEDC_CH2_FADE_PAUSE_V << LEDC_CH2_FADE_PAUSE_S)
#define LEDC_CH2_FADE_PAUSE_V  0x00000001U
#define LEDC_CH2_FADE_PAUSE_S  5
/** LEDC_CH2_FADE_RESUME : WT; bitpos: [6]; default: 0;
 *  Configures whether or nor to resume duty cycle fading of LEDC ch2.
 *  0: Invalid. No effect
 *  1: Resume
 */
#define LEDC_CH2_FADE_RESUME    (BIT(6))
#define LEDC_CH2_FADE_RESUME_M  (LEDC_CH2_FADE_RESUME_V << LEDC_CH2_FADE_RESUME_S)
#define LEDC_CH2_FADE_RESUME_V  0x00000001U
#define LEDC_CH2_FADE_RESUME_S  6

/** LEDC_CH3_FADE_CONF_REG register
 *  Ledc ch3 fade config register.
 */
#define LEDC_CH3_FADE_CONF_REG (DR_REG_LEDC_BASE + 0x10c)
/** LEDC_CH3_FADE_PAUSE : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to pause duty cycle fading of LEDC ch3.
 *  0: Invalid. No effect
 *  1: Pause
 */
#define LEDC_CH3_FADE_PAUSE    (BIT(5))
#define LEDC_CH3_FADE_PAUSE_M  (LEDC_CH3_FADE_PAUSE_V << LEDC_CH3_FADE_PAUSE_S)
#define LEDC_CH3_FADE_PAUSE_V  0x00000001U
#define LEDC_CH3_FADE_PAUSE_S  5
/** LEDC_CH3_FADE_RESUME : WT; bitpos: [6]; default: 0;
 *  Configures whether or nor to resume duty cycle fading of LEDC ch3.
 *  0: Invalid. No effect
 *  1: Resume
 */
#define LEDC_CH3_FADE_RESUME    (BIT(6))
#define LEDC_CH3_FADE_RESUME_M  (LEDC_CH3_FADE_RESUME_V << LEDC_CH3_FADE_RESUME_S)
#define LEDC_CH3_FADE_RESUME_V  0x00000001U
#define LEDC_CH3_FADE_RESUME_S  6

/** LEDC_CH4_FADE_CONF_REG register
 *  Ledc ch4 fade config register.
 */
#define LEDC_CH4_FADE_CONF_REG (DR_REG_LEDC_BASE + 0x110)
/** LEDC_CH4_FADE_PAUSE : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to pause duty cycle fading of LEDC ch4.
 *  0: Invalid. No effect
 *  1: Pause
 */
#define LEDC_CH4_FADE_PAUSE    (BIT(5))
#define LEDC_CH4_FADE_PAUSE_M  (LEDC_CH4_FADE_PAUSE_V << LEDC_CH4_FADE_PAUSE_S)
#define LEDC_CH4_FADE_PAUSE_V  0x00000001U
#define LEDC_CH4_FADE_PAUSE_S  5
/** LEDC_CH4_FADE_RESUME : WT; bitpos: [6]; default: 0;
 *  Configures whether or nor to resume duty cycle fading of LEDC ch4.
 *  0: Invalid. No effect
 *  1: Resume
 */
#define LEDC_CH4_FADE_RESUME    (BIT(6))
#define LEDC_CH4_FADE_RESUME_M  (LEDC_CH4_FADE_RESUME_V << LEDC_CH4_FADE_RESUME_S)
#define LEDC_CH4_FADE_RESUME_V  0x00000001U
#define LEDC_CH4_FADE_RESUME_S  6

/** LEDC_CH5_FADE_CONF_REG register
 *  Ledc ch5 fade config register.
 */
#define LEDC_CH5_FADE_CONF_REG (DR_REG_LEDC_BASE + 0x114)
/** LEDC_CH5_FADE_PAUSE : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to pause duty cycle fading of LEDC ch5.
 *  0: Invalid. No effect
 *  1: Pause
 */
#define LEDC_CH5_FADE_PAUSE    (BIT(5))
#define LEDC_CH5_FADE_PAUSE_M  (LEDC_CH5_FADE_PAUSE_V << LEDC_CH5_FADE_PAUSE_S)
#define LEDC_CH5_FADE_PAUSE_V  0x00000001U
#define LEDC_CH5_FADE_PAUSE_S  5
/** LEDC_CH5_FADE_RESUME : WT; bitpos: [6]; default: 0;
 *  Configures whether or nor to resume duty cycle fading of LEDC ch5.
 *  0: Invalid. No effect
 *  1: Resume
 */
#define LEDC_CH5_FADE_RESUME    (BIT(6))
#define LEDC_CH5_FADE_RESUME_M  (LEDC_CH5_FADE_RESUME_V << LEDC_CH5_FADE_RESUME_S)
#define LEDC_CH5_FADE_RESUME_V  0x00000001U
#define LEDC_CH5_FADE_RESUME_S  6

/** LEDC_CH6_FADE_CONF_REG register
 *  Ledc ch6 fade config register.
 */
#define LEDC_CH6_FADE_CONF_REG (DR_REG_LEDC_BASE + 0x118)
/** LEDC_CH6_FADE_PAUSE : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to pause duty cycle fading of LEDC ch6.
 *  0: Invalid. No effect
 *  1: Pause
 */
#define LEDC_CH6_FADE_PAUSE    (BIT(5))
#define LEDC_CH6_FADE_PAUSE_M  (LEDC_CH6_FADE_PAUSE_V << LEDC_CH6_FADE_PAUSE_S)
#define LEDC_CH6_FADE_PAUSE_V  0x00000001U
#define LEDC_CH6_FADE_PAUSE_S  5
/** LEDC_CH6_FADE_RESUME : WT; bitpos: [6]; default: 0;
 *  Configures whether or nor to resume duty cycle fading of LEDC ch6.
 *  0: Invalid. No effect
 *  1: Resume
 */
#define LEDC_CH6_FADE_RESUME    (BIT(6))
#define LEDC_CH6_FADE_RESUME_M  (LEDC_CH6_FADE_RESUME_V << LEDC_CH6_FADE_RESUME_S)
#define LEDC_CH6_FADE_RESUME_V  0x00000001U
#define LEDC_CH6_FADE_RESUME_S  6

/** LEDC_CH7_FADE_CONF_REG register
 *  Ledc ch7 fade config register.
 */
#define LEDC_CH7_FADE_CONF_REG (DR_REG_LEDC_BASE + 0x11c)
/** LEDC_CH7_FADE_PAUSE : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to pause duty cycle fading of LEDC ch7.
 *  0: Invalid. No effect
 *  1: Pause
 */
#define LEDC_CH7_FADE_PAUSE    (BIT(5))
#define LEDC_CH7_FADE_PAUSE_M  (LEDC_CH7_FADE_PAUSE_V << LEDC_CH7_FADE_PAUSE_S)
#define LEDC_CH7_FADE_PAUSE_V  0x00000001U
#define LEDC_CH7_FADE_PAUSE_S  5
/** LEDC_CH7_FADE_RESUME : WT; bitpos: [6]; default: 0;
 *  Configures whether or nor to resume duty cycle fading of LEDC ch7.
 *  0: Invalid. No effect
 *  1: Resume
 */
#define LEDC_CH7_FADE_RESUME    (BIT(6))
#define LEDC_CH7_FADE_RESUME_M  (LEDC_CH7_FADE_RESUME_V << LEDC_CH7_FADE_RESUME_S)
#define LEDC_CH7_FADE_RESUME_V  0x00000001U
#define LEDC_CH7_FADE_RESUME_S  6

/** LEDC_EVT_TASK_EN0_REG register
 *  Ledc event task enable bit register0.
 */
#define LEDC_EVT_TASK_EN0_REG (DR_REG_LEDC_BASE + 0x120)
/** LEDC_EVT_DUTY_CHNG_END_CH0_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH0 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_DUTY_CHNG_END_CH0_EN    (BIT(0))
#define LEDC_EVT_DUTY_CHNG_END_CH0_EN_M  (LEDC_EVT_DUTY_CHNG_END_CH0_EN_V << LEDC_EVT_DUTY_CHNG_END_CH0_EN_S)
#define LEDC_EVT_DUTY_CHNG_END_CH0_EN_V  0x00000001U
#define LEDC_EVT_DUTY_CHNG_END_CH0_EN_S  0
/** LEDC_EVT_DUTY_CHNG_END_CH1_EN : R/W; bitpos: [1]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH1 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_DUTY_CHNG_END_CH1_EN    (BIT(1))
#define LEDC_EVT_DUTY_CHNG_END_CH1_EN_M  (LEDC_EVT_DUTY_CHNG_END_CH1_EN_V << LEDC_EVT_DUTY_CHNG_END_CH1_EN_S)
#define LEDC_EVT_DUTY_CHNG_END_CH1_EN_V  0x00000001U
#define LEDC_EVT_DUTY_CHNG_END_CH1_EN_S  1
/** LEDC_EVT_DUTY_CHNG_END_CH2_EN : R/W; bitpos: [2]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH2 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_DUTY_CHNG_END_CH2_EN    (BIT(2))
#define LEDC_EVT_DUTY_CHNG_END_CH2_EN_M  (LEDC_EVT_DUTY_CHNG_END_CH2_EN_V << LEDC_EVT_DUTY_CHNG_END_CH2_EN_S)
#define LEDC_EVT_DUTY_CHNG_END_CH2_EN_V  0x00000001U
#define LEDC_EVT_DUTY_CHNG_END_CH2_EN_S  2
/** LEDC_EVT_DUTY_CHNG_END_CH3_EN : R/W; bitpos: [3]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH3 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_DUTY_CHNG_END_CH3_EN    (BIT(3))
#define LEDC_EVT_DUTY_CHNG_END_CH3_EN_M  (LEDC_EVT_DUTY_CHNG_END_CH3_EN_V << LEDC_EVT_DUTY_CHNG_END_CH3_EN_S)
#define LEDC_EVT_DUTY_CHNG_END_CH3_EN_V  0x00000001U
#define LEDC_EVT_DUTY_CHNG_END_CH3_EN_S  3
/** LEDC_EVT_DUTY_CHNG_END_CH4_EN : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH4 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_DUTY_CHNG_END_CH4_EN    (BIT(4))
#define LEDC_EVT_DUTY_CHNG_END_CH4_EN_M  (LEDC_EVT_DUTY_CHNG_END_CH4_EN_V << LEDC_EVT_DUTY_CHNG_END_CH4_EN_S)
#define LEDC_EVT_DUTY_CHNG_END_CH4_EN_V  0x00000001U
#define LEDC_EVT_DUTY_CHNG_END_CH4_EN_S  4
/** LEDC_EVT_DUTY_CHNG_END_CH5_EN : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH5 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_DUTY_CHNG_END_CH5_EN    (BIT(5))
#define LEDC_EVT_DUTY_CHNG_END_CH5_EN_M  (LEDC_EVT_DUTY_CHNG_END_CH5_EN_V << LEDC_EVT_DUTY_CHNG_END_CH5_EN_S)
#define LEDC_EVT_DUTY_CHNG_END_CH5_EN_V  0x00000001U
#define LEDC_EVT_DUTY_CHNG_END_CH5_EN_S  5
/** LEDC_EVT_DUTY_CHNG_END_CH6_EN : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH6 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_DUTY_CHNG_END_CH6_EN    (BIT(6))
#define LEDC_EVT_DUTY_CHNG_END_CH6_EN_M  (LEDC_EVT_DUTY_CHNG_END_CH6_EN_V << LEDC_EVT_DUTY_CHNG_END_CH6_EN_S)
#define LEDC_EVT_DUTY_CHNG_END_CH6_EN_V  0x00000001U
#define LEDC_EVT_DUTY_CHNG_END_CH6_EN_S  6
/** LEDC_EVT_DUTY_CHNG_END_CH7_EN : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_DUTY_CHNG_END_CH7 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_DUTY_CHNG_END_CH7_EN    (BIT(7))
#define LEDC_EVT_DUTY_CHNG_END_CH7_EN_M  (LEDC_EVT_DUTY_CHNG_END_CH7_EN_V << LEDC_EVT_DUTY_CHNG_END_CH7_EN_S)
#define LEDC_EVT_DUTY_CHNG_END_CH7_EN_V  0x00000001U
#define LEDC_EVT_DUTY_CHNG_END_CH7_EN_S  7
/** LEDC_EVT_OVF_CNT_PLS_CH0_EN : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH0 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_OVF_CNT_PLS_CH0_EN    (BIT(8))
#define LEDC_EVT_OVF_CNT_PLS_CH0_EN_M  (LEDC_EVT_OVF_CNT_PLS_CH0_EN_V << LEDC_EVT_OVF_CNT_PLS_CH0_EN_S)
#define LEDC_EVT_OVF_CNT_PLS_CH0_EN_V  0x00000001U
#define LEDC_EVT_OVF_CNT_PLS_CH0_EN_S  8
/** LEDC_EVT_OVF_CNT_PLS_CH1_EN : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH1 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_OVF_CNT_PLS_CH1_EN    (BIT(9))
#define LEDC_EVT_OVF_CNT_PLS_CH1_EN_M  (LEDC_EVT_OVF_CNT_PLS_CH1_EN_V << LEDC_EVT_OVF_CNT_PLS_CH1_EN_S)
#define LEDC_EVT_OVF_CNT_PLS_CH1_EN_V  0x00000001U
#define LEDC_EVT_OVF_CNT_PLS_CH1_EN_S  9
/** LEDC_EVT_OVF_CNT_PLS_CH2_EN : R/W; bitpos: [10]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH2 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_OVF_CNT_PLS_CH2_EN    (BIT(10))
#define LEDC_EVT_OVF_CNT_PLS_CH2_EN_M  (LEDC_EVT_OVF_CNT_PLS_CH2_EN_V << LEDC_EVT_OVF_CNT_PLS_CH2_EN_S)
#define LEDC_EVT_OVF_CNT_PLS_CH2_EN_V  0x00000001U
#define LEDC_EVT_OVF_CNT_PLS_CH2_EN_S  10
/** LEDC_EVT_OVF_CNT_PLS_CH3_EN : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH3 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_OVF_CNT_PLS_CH3_EN    (BIT(11))
#define LEDC_EVT_OVF_CNT_PLS_CH3_EN_M  (LEDC_EVT_OVF_CNT_PLS_CH3_EN_V << LEDC_EVT_OVF_CNT_PLS_CH3_EN_S)
#define LEDC_EVT_OVF_CNT_PLS_CH3_EN_V  0x00000001U
#define LEDC_EVT_OVF_CNT_PLS_CH3_EN_S  11
/** LEDC_EVT_OVF_CNT_PLS_CH4_EN : R/W; bitpos: [12]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH4 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_OVF_CNT_PLS_CH4_EN    (BIT(12))
#define LEDC_EVT_OVF_CNT_PLS_CH4_EN_M  (LEDC_EVT_OVF_CNT_PLS_CH4_EN_V << LEDC_EVT_OVF_CNT_PLS_CH4_EN_S)
#define LEDC_EVT_OVF_CNT_PLS_CH4_EN_V  0x00000001U
#define LEDC_EVT_OVF_CNT_PLS_CH4_EN_S  12
/** LEDC_EVT_OVF_CNT_PLS_CH5_EN : R/W; bitpos: [13]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH5 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_OVF_CNT_PLS_CH5_EN    (BIT(13))
#define LEDC_EVT_OVF_CNT_PLS_CH5_EN_M  (LEDC_EVT_OVF_CNT_PLS_CH5_EN_V << LEDC_EVT_OVF_CNT_PLS_CH5_EN_S)
#define LEDC_EVT_OVF_CNT_PLS_CH5_EN_V  0x00000001U
#define LEDC_EVT_OVF_CNT_PLS_CH5_EN_S  13
/** LEDC_EVT_OVF_CNT_PLS_CH6_EN : R/W; bitpos: [14]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH6 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_OVF_CNT_PLS_CH6_EN    (BIT(14))
#define LEDC_EVT_OVF_CNT_PLS_CH6_EN_M  (LEDC_EVT_OVF_CNT_PLS_CH6_EN_V << LEDC_EVT_OVF_CNT_PLS_CH6_EN_S)
#define LEDC_EVT_OVF_CNT_PLS_CH6_EN_V  0x00000001U
#define LEDC_EVT_OVF_CNT_PLS_CH6_EN_S  14
/** LEDC_EVT_OVF_CNT_PLS_CH7_EN : R/W; bitpos: [15]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_OVF_CNT_PLS_CH7 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_OVF_CNT_PLS_CH7_EN    (BIT(15))
#define LEDC_EVT_OVF_CNT_PLS_CH7_EN_M  (LEDC_EVT_OVF_CNT_PLS_CH7_EN_V << LEDC_EVT_OVF_CNT_PLS_CH7_EN_S)
#define LEDC_EVT_OVF_CNT_PLS_CH7_EN_V  0x00000001U
#define LEDC_EVT_OVF_CNT_PLS_CH7_EN_S  15
/** LEDC_EVT_TIME_OVF_TIMER0_EN : R/W; bitpos: [16]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER0 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_TIME_OVF_TIMER0_EN    (BIT(16))
#define LEDC_EVT_TIME_OVF_TIMER0_EN_M  (LEDC_EVT_TIME_OVF_TIMER0_EN_V << LEDC_EVT_TIME_OVF_TIMER0_EN_S)
#define LEDC_EVT_TIME_OVF_TIMER0_EN_V  0x00000001U
#define LEDC_EVT_TIME_OVF_TIMER0_EN_S  16
/** LEDC_EVT_TIME_OVF_TIMER1_EN : R/W; bitpos: [17]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER1 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_TIME_OVF_TIMER1_EN    (BIT(17))
#define LEDC_EVT_TIME_OVF_TIMER1_EN_M  (LEDC_EVT_TIME_OVF_TIMER1_EN_V << LEDC_EVT_TIME_OVF_TIMER1_EN_S)
#define LEDC_EVT_TIME_OVF_TIMER1_EN_V  0x00000001U
#define LEDC_EVT_TIME_OVF_TIMER1_EN_S  17
/** LEDC_EVT_TIME_OVF_TIMER2_EN : R/W; bitpos: [18]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER2 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_TIME_OVF_TIMER2_EN    (BIT(18))
#define LEDC_EVT_TIME_OVF_TIMER2_EN_M  (LEDC_EVT_TIME_OVF_TIMER2_EN_V << LEDC_EVT_TIME_OVF_TIMER2_EN_S)
#define LEDC_EVT_TIME_OVF_TIMER2_EN_V  0x00000001U
#define LEDC_EVT_TIME_OVF_TIMER2_EN_S  18
/** LEDC_EVT_TIME_OVF_TIMER3_EN : R/W; bitpos: [19]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_TIME_OVF_TIMER3 event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_TIME_OVF_TIMER3_EN    (BIT(19))
#define LEDC_EVT_TIME_OVF_TIMER3_EN_M  (LEDC_EVT_TIME_OVF_TIMER3_EN_V << LEDC_EVT_TIME_OVF_TIMER3_EN_S)
#define LEDC_EVT_TIME_OVF_TIMER3_EN_V  0x00000001U
#define LEDC_EVT_TIME_OVF_TIMER3_EN_S  19
/** LEDC_EVT_TIMER0_CMP_EN : R/W; bitpos: [20]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_TIMER0_CMP event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_TIMER0_CMP_EN    (BIT(20))
#define LEDC_EVT_TIMER0_CMP_EN_M  (LEDC_EVT_TIMER0_CMP_EN_V << LEDC_EVT_TIMER0_CMP_EN_S)
#define LEDC_EVT_TIMER0_CMP_EN_V  0x00000001U
#define LEDC_EVT_TIMER0_CMP_EN_S  20
/** LEDC_EVT_TIMER1_CMP_EN : R/W; bitpos: [21]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_TIMER1_CMP event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_TIMER1_CMP_EN    (BIT(21))
#define LEDC_EVT_TIMER1_CMP_EN_M  (LEDC_EVT_TIMER1_CMP_EN_V << LEDC_EVT_TIMER1_CMP_EN_S)
#define LEDC_EVT_TIMER1_CMP_EN_V  0x00000001U
#define LEDC_EVT_TIMER1_CMP_EN_S  21
/** LEDC_EVT_TIMER2_CMP_EN : R/W; bitpos: [22]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_TIMER2_CMP event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_TIMER2_CMP_EN    (BIT(22))
#define LEDC_EVT_TIMER2_CMP_EN_M  (LEDC_EVT_TIMER2_CMP_EN_V << LEDC_EVT_TIMER2_CMP_EN_S)
#define LEDC_EVT_TIMER2_CMP_EN_V  0x00000001U
#define LEDC_EVT_TIMER2_CMP_EN_S  22
/** LEDC_EVT_TIMER3_CMP_EN : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to enable the LEDC_EVT_TIMER3_CMP event.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_EVT_TIMER3_CMP_EN    (BIT(23))
#define LEDC_EVT_TIMER3_CMP_EN_M  (LEDC_EVT_TIMER3_CMP_EN_V << LEDC_EVT_TIMER3_CMP_EN_S)
#define LEDC_EVT_TIMER3_CMP_EN_V  0x00000001U
#define LEDC_EVT_TIMER3_CMP_EN_S  23
/** LEDC_TASK_DUTY_SCALE_UPDATE_CH0_EN : R/W; bitpos: [24]; default: 0;
 *  Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH0 task.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH0_EN    (BIT(24))
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH0_EN_M  (LEDC_TASK_DUTY_SCALE_UPDATE_CH0_EN_V << LEDC_TASK_DUTY_SCALE_UPDATE_CH0_EN_S)
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH0_EN_V  0x00000001U
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH0_EN_S  24
/** LEDC_TASK_DUTY_SCALE_UPDATE_CH1_EN : R/W; bitpos: [25]; default: 0;
 *  Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH1 task.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH1_EN    (BIT(25))
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH1_EN_M  (LEDC_TASK_DUTY_SCALE_UPDATE_CH1_EN_V << LEDC_TASK_DUTY_SCALE_UPDATE_CH1_EN_S)
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH1_EN_V  0x00000001U
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH1_EN_S  25
/** LEDC_TASK_DUTY_SCALE_UPDATE_CH2_EN : R/W; bitpos: [26]; default: 0;
 *  Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH2 task.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH2_EN    (BIT(26))
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH2_EN_M  (LEDC_TASK_DUTY_SCALE_UPDATE_CH2_EN_V << LEDC_TASK_DUTY_SCALE_UPDATE_CH2_EN_S)
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH2_EN_V  0x00000001U
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH2_EN_S  26
/** LEDC_TASK_DUTY_SCALE_UPDATE_CH3_EN : R/W; bitpos: [27]; default: 0;
 *  Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH3 task.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH3_EN    (BIT(27))
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH3_EN_M  (LEDC_TASK_DUTY_SCALE_UPDATE_CH3_EN_V << LEDC_TASK_DUTY_SCALE_UPDATE_CH3_EN_S)
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH3_EN_V  0x00000001U
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH3_EN_S  27
/** LEDC_TASK_DUTY_SCALE_UPDATE_CH4_EN : R/W; bitpos: [28]; default: 0;
 *  Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH4 task.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH4_EN    (BIT(28))
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH4_EN_M  (LEDC_TASK_DUTY_SCALE_UPDATE_CH4_EN_V << LEDC_TASK_DUTY_SCALE_UPDATE_CH4_EN_S)
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH4_EN_V  0x00000001U
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH4_EN_S  28
/** LEDC_TASK_DUTY_SCALE_UPDATE_CH5_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH5 task.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH5_EN    (BIT(29))
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH5_EN_M  (LEDC_TASK_DUTY_SCALE_UPDATE_CH5_EN_V << LEDC_TASK_DUTY_SCALE_UPDATE_CH5_EN_S)
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH5_EN_V  0x00000001U
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH5_EN_S  29
/** LEDC_TASK_DUTY_SCALE_UPDATE_CH6_EN : R/W; bitpos: [30]; default: 0;
 *  Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH6 task.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH6_EN    (BIT(30))
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH6_EN_M  (LEDC_TASK_DUTY_SCALE_UPDATE_CH6_EN_V << LEDC_TASK_DUTY_SCALE_UPDATE_CH6_EN_S)
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH6_EN_V  0x00000001U
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH6_EN_S  30
/** LEDC_TASK_DUTY_SCALE_UPDATE_CH7_EN : R/W; bitpos: [31]; default: 0;
 *  Configures whether or not to enable the LEDC_TASK_DUTY_SCALE_UPDATE_CH7 task.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH7_EN    (BIT(31))
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH7_EN_M  (LEDC_TASK_DUTY_SCALE_UPDATE_CH7_EN_V << LEDC_TASK_DUTY_SCALE_UPDATE_CH7_EN_S)
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH7_EN_V  0x00000001U
#define LEDC_TASK_DUTY_SCALE_UPDATE_CH7_EN_S  31

