espressif/esp-idf/components/soc/esp32h4/register/soc/ledc_reg.h
/** LEDC_TIMER1_CMP_REG register
 *  Ledc timer1 compare value register.
 */
#define LEDC_TIMER1_CMP_REG (DR_REG_LEDC_BASE + 0x144)
/** LEDC_TIMER1_CMP : R/W; bitpos: [19:0]; default: 0;
 *  Configures the comparison value for LEDC timer1.
 */
#define LEDC_TIMER1_CMP    0x000FFFFFU
#define LEDC_TIMER1_CMP_M  (LEDC_TIMER1_CMP_V << LEDC_TIMER1_CMP_S)
#define LEDC_TIMER1_CMP_V  0x000FFFFFU
#define LEDC_TIMER1_CMP_S  0

/** LEDC_TIMER2_CMP_REG register
 *  Ledc timer2 compare value register.
 */
#define LEDC_TIMER2_CMP_REG (DR_REG_LEDC_BASE + 0x148)
/** LEDC_TIMER2_CMP : R/W; bitpos: [19:0]; default: 0;
 *  Configures the comparison value for LEDC timer2.
 */
#define LEDC_TIMER2_CMP    0x000FFFFFU
#define LEDC_TIMER2_CMP_M  (LEDC_TIMER2_CMP_V << LEDC_TIMER2_CMP_S)
#define LEDC_TIMER2_CMP_V  0x000FFFFFU
#define LEDC_TIMER2_CMP_S  0

/** LEDC_TIMER3_CMP_REG register
 *  Ledc timer3 compare value register.
 */
#define LEDC_TIMER3_CMP_REG (DR_REG_LEDC_BASE + 0x14c)
/** LEDC_TIMER3_CMP : R/W; bitpos: [19:0]; default: 0;
 *  Configures the comparison value for LEDC timer3.
 */
#define LEDC_TIMER3_CMP    0x000FFFFFU
#define LEDC_TIMER3_CMP_M  (LEDC_TIMER3_CMP_V << LEDC_TIMER3_CMP_S)
#define LEDC_TIMER3_CMP_V  0x000FFFFFU
#define LEDC_TIMER3_CMP_S  0

/** LEDC_TIMER0_CNT_CAP_REG register
 *  Ledc timer0 captured count value register.
 */
#define LEDC_TIMER0_CNT_CAP_REG (DR_REG_LEDC_BASE + 0x150)
/** LEDC_TIMER0_CNT_CAP : RO; bitpos: [19:0]; default: 0;
 *  Represents the captured LEDC timer0 count value.
 */
#define LEDC_TIMER0_CNT_CAP    0x000FFFFFU
#define LEDC_TIMER0_CNT_CAP_M  (LEDC_TIMER0_CNT_CAP_V << LEDC_TIMER0_CNT_CAP_S)
#define LEDC_TIMER0_CNT_CAP_V  0x000FFFFFU
#define LEDC_TIMER0_CNT_CAP_S  0

/** LEDC_TIMER1_CNT_CAP_REG register
 *  Ledc timer1 captured count value register.
 */
#define LEDC_TIMER1_CNT_CAP_REG (DR_REG_LEDC_BASE + 0x154)
/** LEDC_TIMER1_CNT_CAP : RO; bitpos: [19:0]; default: 0;
 *  Represents the captured LEDC timer1 count value.
 */
#define LEDC_TIMER1_CNT_CAP    0x000FFFFFU
#define LEDC_TIMER1_CNT_CAP_M  (LEDC_TIMER1_CNT_CAP_V << LEDC_TIMER1_CNT_CAP_S)
#define LEDC_TIMER1_CNT_CAP_V  0x000FFFFFU
#define LEDC_TIMER1_CNT_CAP_S  0

/** LEDC_TIMER2_CNT_CAP_REG register
 *  Ledc timer2 captured count value register.
 */
#define LEDC_TIMER2_CNT_CAP_REG (DR_REG_LEDC_BASE + 0x158)
/** LEDC_TIMER2_CNT_CAP : RO; bitpos: [19:0]; default: 0;
 *  Represents the captured LEDC timer2 count value.
 */
#define LEDC_TIMER2_CNT_CAP    0x000FFFFFU
#define LEDC_TIMER2_CNT_CAP_M  (LEDC_TIMER2_CNT_CAP_V << LEDC_TIMER2_CNT_CAP_S)
#define LEDC_TIMER2_CNT_CAP_V  0x000FFFFFU
#define LEDC_TIMER2_CNT_CAP_S  0

/** LEDC_TIMER3_CNT_CAP_REG register
 *  Ledc timer3 captured count value register.
 */
#define LEDC_TIMER3_CNT_CAP_REG (DR_REG_LEDC_BASE + 0x15c)
/** LEDC_TIMER3_CNT_CAP : RO; bitpos: [19:0]; default: 0;
 *  Represents the captured LEDC timer3 count value.
 */
#define LEDC_TIMER3_CNT_CAP    0x000FFFFFU
#define LEDC_TIMER3_CNT_CAP_M  (LEDC_TIMER3_CNT_CAP_V << LEDC_TIMER3_CNT_CAP_S)
#define LEDC_TIMER3_CNT_CAP_V  0x000FFFFFU
#define LEDC_TIMER3_CNT_CAP_S  0

/** LEDC_CONF_REG register
 *  LEDC global configuration register
 */
#define LEDC_CONF_REG (DR_REG_LEDC_BASE + 0x170)
/** LEDC_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  Configures whether or not to open register clock gate.
 *  0: Open the clock gate only when application writes registers
 *  1: Force open the clock gate for register
 */
#define LEDC_CLK_EN    (BIT(31))
#define LEDC_CLK_EN_M  (LEDC_CLK_EN_V << LEDC_CLK_EN_S)
#define LEDC_CLK_EN_V  0x00000001U
#define LEDC_CLK_EN_S  31

/** LEDC_CH_POWER_UP_CONF_REG register
 *  LEDC channel power up configuration register
 */
#define LEDC_CH_POWER_UP_CONF_REG (DR_REG_LEDC_BASE + 0x174)
/** LEDC_CH0_POWER_UP : R/W; bitpos: [0]; default: 1;
 *  Configures whether or not to power up ch0.
 *  0: power down
 *  1: power up
 */
#define LEDC_CH0_POWER_UP    (BIT(0))
#define LEDC_CH0_POWER_UP_M  (LEDC_CH0_POWER_UP_V << LEDC_CH0_POWER_UP_S)
#define LEDC_CH0_POWER_UP_V  0x00000001U
#define LEDC_CH0_POWER_UP_S  0
/** LEDC_CH1_POWER_UP : R/W; bitpos: [1]; default: 1;
 *  Configures whether or not to power up ch1.
 *  0: power down
 *  1: power up
 */
#define LEDC_CH1_POWER_UP    (BIT(1))
#define LEDC_CH1_POWER_UP_M  (LEDC_CH1_POWER_UP_V << LEDC_CH1_POWER_UP_S)
#define LEDC_CH1_POWER_UP_V  0x00000001U
#define LEDC_CH1_POWER_UP_S  1
/** LEDC_CH2_POWER_UP : R/W; bitpos: [2]; default: 1;
 *  Configures whether or not to power up ch2.
 *  0: power down
 *  1: power up
 */
#define LEDC_CH2_POWER_UP    (BIT(2))
#define LEDC_CH2_POWER_UP_M  (LEDC_CH2_POWER_UP_V << LEDC_CH2_POWER_UP_S)
#define LEDC_CH2_POWER_UP_V  0x00000001U
#define LEDC_CH2_POWER_UP_S  2
/** LEDC_CH3_POWER_UP : R/W; bitpos: [3]; default: 1;
 *  Configures whether or not to power up ch3.
 *  0: power down
 *  1: power up
 */
#define LEDC_CH3_POWER_UP    (BIT(3))
#define LEDC_CH3_POWER_UP_M  (LEDC_CH3_POWER_UP_V << LEDC_CH3_POWER_UP_S)
#define LEDC_CH3_POWER_UP_V  0x00000001U
#define LEDC_CH3_POWER_UP_S  3
/** LEDC_CH4_POWER_UP : R/W; bitpos: [4]; default: 1;
 *  Configures whether or not to power up ch4.
 *  0: power down
 *  1: power up
 */
#define LEDC_CH4_POWER_UP    (BIT(4))
#define LEDC_CH4_POWER_UP_M  (LEDC_CH4_POWER_UP_V << LEDC_CH4_POWER_UP_S)
#define LEDC_CH4_POWER_UP_V  0x00000001U
#define LEDC_CH4_POWER_UP_S  4
/** LEDC_CH5_POWER_UP : R/W; bitpos: [5]; default: 1;
 *  Configures whether or not to power up ch5.
 *  0: power down
 *  1: power up
 */
#define LEDC_CH5_POWER_UP    (BIT(5))
#define LEDC_CH5_POWER_UP_M  (LEDC_CH5_POWER_UP_V << LEDC_CH5_POWER_UP_S)
#define LEDC_CH5_POWER_UP_V  0x00000001U
#define LEDC_CH5_POWER_UP_S  5
/** LEDC_CH6_POWER_UP : R/W; bitpos: [6]; default: 1;
 *  Configures whether or not to power up ch6.
 *  0: power down
 *  1: power up
 */
#define LEDC_CH6_POWER_UP    (BIT(6))
#define LEDC_CH6_POWER_UP_M  (LEDC_CH6_POWER_UP_V << LEDC_CH6_POWER_UP_S)
#define LEDC_CH6_POWER_UP_V  0x00000001U
#define LEDC_CH6_POWER_UP_S  6
/** LEDC_CH7_POWER_UP : R/W; bitpos: [7]; default: 1;
 *  Configures whether or not to power up ch7.
 *  0: power down
 *  1: power up
 */
#define LEDC_CH7_POWER_UP    (BIT(7))
#define LEDC_CH7_POWER_UP_M  (LEDC_CH7_POWER_UP_V << LEDC_CH7_POWER_UP_S)
#define LEDC_CH7_POWER_UP_V  0x00000001U
#define LEDC_CH7_POWER_UP_S  7
/** LEDC_CH0_CLK_GATE_FORCE_ON : R/W; bitpos: [8]; default: 0;
 *  Configures whether or not to open ch0 clock gate.
 *  0: Open the clock gate only when ch0 is power up
 *  1: Force open the clock gate for ch0
 */
#define LEDC_CH0_CLK_GATE_FORCE_ON    (BIT(8))
#define LEDC_CH0_CLK_GATE_FORCE_ON_M  (LEDC_CH0_CLK_GATE_FORCE_ON_V << LEDC_CH0_CLK_GATE_FORCE_ON_S)
#define LEDC_CH0_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_CH0_CLK_GATE_FORCE_ON_S  8
/** LEDC_CH1_CLK_GATE_FORCE_ON : R/W; bitpos: [9]; default: 0;
 *  Configures whether or not to open ch1 clock gate.
 *  0: Open the clock gate only when ch1 is power up
 *  1: Force open the clock gate for ch1
 */
#define LEDC_CH1_CLK_GATE_FORCE_ON    (BIT(9))
#define LEDC_CH1_CLK_GATE_FORCE_ON_M  (LEDC_CH1_CLK_GATE_FORCE_ON_V << LEDC_CH1_CLK_GATE_FORCE_ON_S)
#define LEDC_CH1_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_CH1_CLK_GATE_FORCE_ON_S  9
/** LEDC_CH2_CLK_GATE_FORCE_ON : R/W; bitpos: [10]; default: 0;
 *  Configures whether or not to open ch2 clock gate.
 *  0: Open the clock gate only when ch2 is power up
 *  1: Force open the clock gate for ch2
 */
#define LEDC_CH2_CLK_GATE_FORCE_ON    (BIT(10))
#define LEDC_CH2_CLK_GATE_FORCE_ON_M  (LEDC_CH2_CLK_GATE_FORCE_ON_V << LEDC_CH2_CLK_GATE_FORCE_ON_S)
#define LEDC_CH2_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_CH2_CLK_GATE_FORCE_ON_S  10
/** LEDC_CH3_CLK_GATE_FORCE_ON : R/W; bitpos: [11]; default: 0;
 *  Configures whether or not to open ch3 clock gate.
 *  0: Open the clock gate only when ch3 is power up
 *  1: Force open the clock gate for ch3
 */
#define LEDC_CH3_CLK_GATE_FORCE_ON    (BIT(11))
#define LEDC_CH3_CLK_GATE_FORCE_ON_M  (LEDC_CH3_CLK_GATE_FORCE_ON_V << LEDC_CH3_CLK_GATE_FORCE_ON_S)
#define LEDC_CH3_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_CH3_CLK_GATE_FORCE_ON_S  11
/** LEDC_CH4_CLK_GATE_FORCE_ON : R/W; bitpos: [12]; default: 0;
 *  Configures whether or not to open ch4 clock gate.
 *  0: Open the clock gate only when ch4 is power up
 *  1: Force open the clock gate for ch4
 */
#define LEDC_CH4_CLK_GATE_FORCE_ON    (BIT(12))
#define LEDC_CH4_CLK_GATE_FORCE_ON_M  (LEDC_CH4_CLK_GATE_FORCE_ON_V << LEDC_CH4_CLK_GATE_FORCE_ON_S)
#define LEDC_CH4_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_CH4_CLK_GATE_FORCE_ON_S  12
/** LEDC_CH5_CLK_GATE_FORCE_ON : R/W; bitpos: [13]; default: 0;
 *  Configures whether or not to open ch5 clock gate.
 *  0: Open the clock gate only when ch5 is power up
 *  1: Force open the clock gate for ch5
 */
#define LEDC_CH5_CLK_GATE_FORCE_ON    (BIT(13))
#define LEDC_CH5_CLK_GATE_FORCE_ON_M  (LEDC_CH5_CLK_GATE_FORCE_ON_V << LEDC_CH5_CLK_GATE_FORCE_ON_S)
#define LEDC_CH5_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_CH5_CLK_GATE_FORCE_ON_S  13
/** LEDC_CH6_CLK_GATE_FORCE_ON : R/W; bitpos: [14]; default: 0;
 *  Configures whether or not to open ch6 clock gate.
 *  0: Open the clock gate only when ch6 is power up
 *  1: Force open the clock gate for ch6
 */
#define LEDC_CH6_CLK_GATE_FORCE_ON    (BIT(14))
#define LEDC_CH6_CLK_GATE_FORCE_ON_M  (LEDC_CH6_CLK_GATE_FORCE_ON_V << LEDC_CH6_CLK_GATE_FORCE_ON_S)
#define LEDC_CH6_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_CH6_CLK_GATE_FORCE_ON_S  14
/** LEDC_CH7_CLK_GATE_FORCE_ON : R/W; bitpos: [15]; default: 0;
 *  Configures whether or not to open ch7 clock gate.
 *  0: Open the clock gate only when ch7 is power up
 *  1: Force open the clock gate for ch7
 */
#define LEDC_CH7_CLK_GATE_FORCE_ON    (BIT(15))
#define LEDC_CH7_CLK_GATE_FORCE_ON_M  (LEDC_CH7_CLK_GATE_FORCE_ON_V << LEDC_CH7_CLK_GATE_FORCE_ON_S)
#define LEDC_CH7_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_CH7_CLK_GATE_FORCE_ON_S  15

