espressif/esp-idf/components/soc/esp32h4/register/soc/ledc_reg.h
/** LEDC_TIMER_POWER_UP_CONF_REG register
 *  LEDC timer power up configuration register
 */
#define LEDC_TIMER_POWER_UP_CONF_REG (DR_REG_LEDC_BASE + 0x178)
/** LEDC_TIMER0_POWER_UP : R/W; bitpos: [0]; default: 1;
 *  Configures whether or not to power up timer0.
 *  0: power down
 *  1: power up
 */
#define LEDC_TIMER0_POWER_UP    (BIT(0))
#define LEDC_TIMER0_POWER_UP_M  (LEDC_TIMER0_POWER_UP_V << LEDC_TIMER0_POWER_UP_S)
#define LEDC_TIMER0_POWER_UP_V  0x00000001U
#define LEDC_TIMER0_POWER_UP_S  0
/** LEDC_TIMER1_POWER_UP : R/W; bitpos: [1]; default: 1;
 *  Configures whether or not to power up timer1.
 *  0: power down
 *  1: power up
 */
#define LEDC_TIMER1_POWER_UP    (BIT(1))
#define LEDC_TIMER1_POWER_UP_M  (LEDC_TIMER1_POWER_UP_V << LEDC_TIMER1_POWER_UP_S)
#define LEDC_TIMER1_POWER_UP_V  0x00000001U
#define LEDC_TIMER1_POWER_UP_S  1
/** LEDC_TIMER2_POWER_UP : R/W; bitpos: [2]; default: 1;
 *  Configures whether or not to power up timer2.
 *  0: power down
 *  1: power up
 */
#define LEDC_TIMER2_POWER_UP    (BIT(2))
#define LEDC_TIMER2_POWER_UP_M  (LEDC_TIMER2_POWER_UP_V << LEDC_TIMER2_POWER_UP_S)
#define LEDC_TIMER2_POWER_UP_V  0x00000001U
#define LEDC_TIMER2_POWER_UP_S  2
/** LEDC_TIMER3_POWER_UP : R/W; bitpos: [3]; default: 1;
 *  Configures whether or not to power up timer3.
 *  0: power down
 *  1: power up
 */
#define LEDC_TIMER3_POWER_UP    (BIT(3))
#define LEDC_TIMER3_POWER_UP_M  (LEDC_TIMER3_POWER_UP_V << LEDC_TIMER3_POWER_UP_S)
#define LEDC_TIMER3_POWER_UP_V  0x00000001U
#define LEDC_TIMER3_POWER_UP_S  3
/** LEDC_TIMER0_CLK_GATE_FORCE_ON : R/W; bitpos: [4]; default: 0;
 *  Configures whether or not to open timer0 clock gate.
 *  0: Open the clock gate only when timer0 is power up
 *  1: Force open the clock gate for timer0
 */
#define LEDC_TIMER0_CLK_GATE_FORCE_ON    (BIT(4))
#define LEDC_TIMER0_CLK_GATE_FORCE_ON_M  (LEDC_TIMER0_CLK_GATE_FORCE_ON_V << LEDC_TIMER0_CLK_GATE_FORCE_ON_S)
#define LEDC_TIMER0_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_TIMER0_CLK_GATE_FORCE_ON_S  4
/** LEDC_TIMER1_CLK_GATE_FORCE_ON : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to open timer1 clock gate.
 *  0: Open the clock gate only when timer1 is power up
 *  1: Force open the clock gate for timer1
 */
#define LEDC_TIMER1_CLK_GATE_FORCE_ON    (BIT(5))
#define LEDC_TIMER1_CLK_GATE_FORCE_ON_M  (LEDC_TIMER1_CLK_GATE_FORCE_ON_V << LEDC_TIMER1_CLK_GATE_FORCE_ON_S)
#define LEDC_TIMER1_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_TIMER1_CLK_GATE_FORCE_ON_S  5
/** LEDC_TIMER2_CLK_GATE_FORCE_ON : R/W; bitpos: [6]; default: 0;
 *  Configures whether or not to open timer2 clock gate.
 *  0: Open the clock gate only when timer2 is power up
 *  1: Force open the clock gate for timer2
 */
#define LEDC_TIMER2_CLK_GATE_FORCE_ON    (BIT(6))
#define LEDC_TIMER2_CLK_GATE_FORCE_ON_M  (LEDC_TIMER2_CLK_GATE_FORCE_ON_V << LEDC_TIMER2_CLK_GATE_FORCE_ON_S)
#define LEDC_TIMER2_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_TIMER2_CLK_GATE_FORCE_ON_S  6
/** LEDC_TIMER3_CLK_GATE_FORCE_ON : R/W; bitpos: [7]; default: 0;
 *  Configures whether or not to open timer3 clock gate.
 *  0: Open the clock gate only when timer3 is power up
 *  1: Force open the clock gate for timer3
 */
#define LEDC_TIMER3_CLK_GATE_FORCE_ON    (BIT(7))
#define LEDC_TIMER3_CLK_GATE_FORCE_ON_M  (LEDC_TIMER3_CLK_GATE_FORCE_ON_V << LEDC_TIMER3_CLK_GATE_FORCE_ON_S)
#define LEDC_TIMER3_CLK_GATE_FORCE_ON_V  0x00000001U
#define LEDC_TIMER3_CLK_GATE_FORCE_ON_S  7

/** LEDC_DATE_REG register
 *  Version control register
 */
#define LEDC_DATE_REG (DR_REG_LEDC_BASE + 0x17c)
/** LEDC_LEDC_DATE : R/W; bitpos: [27:0]; default: 37765488;
 *  Configures the version.
 */
#define LEDC_LEDC_DATE    0x0FFFFFFFU
#define LEDC_LEDC_DATE_M  (LEDC_LEDC_DATE_V << LEDC_LEDC_DATE_S)
#define LEDC_LEDC_DATE_V  0x0FFFFFFFU
#define LEDC_LEDC_DATE_S  0

/** LEDC fade parameter config registers
 *  1 words (32bit) per channel * 8 channels
 */
#define LEDC_CH0_FADE_PARAM_REG  (DR_REG_LEDC_BASE + 0x400)
/* LEDC_CH0_FADE_PARAM_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH0_FADE_PARAM_DUTY_NUM    0x000003FF
#define LEDC_CH0_FADE_PARAM_DUTY_NUM_M  ((LEDC_CH0_FADE_PARAM_DUTY_NUM_V)<<(LEDC_CH0_FADE_PARAM_DUTY_NUM_S))
#define LEDC_CH0_FADE_PARAM_DUTY_NUM_V  0x3FF
#define LEDC_CH0_FADE_PARAM_DUTY_NUM_S  21
/* LEDC_CH0_FADE_PARAM_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH0_FADE_PARAM_SCALE    0x000003FF
#define LEDC_CH0_FADE_PARAM_SCALE_M  ((LEDC_CH0_FADE_PARAM_SCALE_V)<<(LEDC_CH0_FADE_PARAM_SCALE_S))
#define LEDC_CH0_FADE_PARAM_SCALE_V  0x3FF
#define LEDC_CH0_FADE_PARAM_SCALE_S  11
/* LEDC_CH0_FADE_PARAM_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH0_FADE_PARAM_DUTY_CYCLE    0x000003FF
#define LEDC_CH0_FADE_PARAM_DUTY_CYCLE_M  ((LEDC_CH0_FADE_PARAM_DUTY_CYCLE_V)<<(LEDC_CH0_FADE_PARAM_DUTY_CYCLE_S))
#define LEDC_CH0_FADE_PARAM_DUTY_CYCLE_V  0x3FF
#define LEDC_CH0_FADE_PARAM_DUTY_CYCLE_S  1
/* LEDC_CH0_FADE_PARAM_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH0_FADE_PARAM_DUTY_INC    (BIT(0))
#define LEDC_CH0_FADE_PARAM_DUTY_INC_M  (BIT(0))
#define LEDC_CH0_FADE_PARAM_DUTY_INC_V  0x1
#define LEDC_CH0_FADE_PARAM_DUTY_INC_S  0


#define LEDC_CH1_FADE_PARAM_REG  (DR_REG_LEDC_BASE + 0x440)
/* LEDC_CH1_FADE_PARAM_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH1_FADE_PARAM_DUTY_NUM    0x000003FF
#define LEDC_CH1_FADE_PARAM_DUTY_NUM_M  ((LEDC_CH1_FADE_PARAM_DUTY_NUM_V)<<(LEDC_CH1_FADE_PARAM_DUTY_NUM_S))
#define LEDC_CH1_FADE_PARAM_DUTY_NUM_V  0x3FF
#define LEDC_CH1_FADE_PARAM_DUTY_NUM_S  21
/* LEDC_CH1_FADE_PARAM_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH1_FADE_PARAM_SCALE    0x000003FF
#define LEDC_CH1_FADE_PARAM_SCALE_M  ((LEDC_CH1_FADE_PARAM_SCALE_V)<<(LEDC_CH1_FADE_PARAM_SCALE_S))
#define LEDC_CH1_FADE_PARAM_SCALE_V  0x3FF
#define LEDC_CH1_FADE_PARAM_SCALE_S  11
/* LEDC_CH1_FADE_PARAM_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH1_FADE_PARAM_DUTY_CYCLE    0x000003FF
#define LEDC_CH1_FADE_PARAM_DUTY_CYCLE_M  ((LEDC_CH1_FADE_PARAM_DUTY_CYCLE_V)<<(LEDC_CH1_FADE_PARAM_DUTY_CYCLE_S))
#define LEDC_CH1_FADE_PARAM_DUTY_CYCLE_V  0x3FF
#define LEDC_CH1_FADE_PARAM_DUTY_CYCLE_S  1
/* LEDC_CH1_FADE_PARAM_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH1_FADE_PARAM_DUTY_INC    (BIT(0))
#define LEDC_CH1_FADE_PARAM_DUTY_INC_M  (BIT(0))
#define LEDC_CH1_FADE_PARAM_DUTY_INC_V  0x1
#define LEDC_CH1_FADE_PARAM_DUTY_INC_S  0


#define LEDC_CH2_FADE_PARAM_REG  (DR_REG_LEDC_BASE + 0x480)
/* LEDC_CH2_FADE_PARAM_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH2_FADE_PARAM_DUTY_NUM    0x000003FF
#define LEDC_CH2_FADE_PARAM_DUTY_NUM_M  ((LEDC_CH2_FADE_PARAM_DUTY_NUM_V)<<(LEDC_CH2_FADE_PARAM_DUTY_NUM_S))
#define LEDC_CH2_FADE_PARAM_DUTY_NUM_V  0x3FF
#define LEDC_CH2_FADE_PARAM_DUTY_NUM_S  21
/* LEDC_CH2_FADE_PARAM_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH2_FADE_PARAM_SCALE    0x000003FF
#define LEDC_CH2_FADE_PARAM_SCALE_M  ((LEDC_CH2_FADE_PARAM_SCALE_V)<<(LEDC_CH2_FADE_PARAM_SCALE_S))
#define LEDC_CH2_FADE_PARAM_SCALE_V  0x3FF
#define LEDC_CH2_FADE_PARAM_SCALE_S  11
/* LEDC_CH2_FADE_PARAM_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH2_FADE_PARAM_DUTY_CYCLE    0x000003FF
#define LEDC_CH2_FADE_PARAM_DUTY_CYCLE_M  ((LEDC_CH2_FADE_PARAM_DUTY_CYCLE_V)<<(LEDC_CH2_FADE_PARAM_DUTY_CYCLE_S))
#define LEDC_CH2_FADE_PARAM_DUTY_CYCLE_V  0x3FF
#define LEDC_CH2_FADE_PARAM_DUTY_CYCLE_S  1
/* LEDC_CH2_FADE_PARAM_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH2_FADE_PARAM_DUTY_INC    (BIT(0))
#define LEDC_CH2_FADE_PARAM_DUTY_INC_M  (BIT(0))
#define LEDC_CH2_FADE_PARAM_DUTY_INC_V  0x1
#define LEDC_CH2_FADE_PARAM_DUTY_INC_S  0


#define LEDC_CH3_FADE_PARAM_REG  (DR_REG_LEDC_BASE + 0x4c0)
/* LEDC_CH3_FADE_PARAM_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_FADE_PARAM_DUTY_NUM    0x000003FF
#define LEDC_CH3_FADE_PARAM_DUTY_NUM_M  ((LEDC_CH3_FADE_PARAM_DUTY_NUM_V)<<(LEDC_CH3_FADE_PARAM_DUTY_NUM_S))
#define LEDC_CH3_FADE_PARAM_DUTY_NUM_V  0x3FF
#define LEDC_CH3_FADE_PARAM_DUTY_NUM_S  21
/* LEDC_CH3_FADE_PARAM_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_FADE_PARAM_SCALE    0x000003FF
#define LEDC_CH3_FADE_PARAM_SCALE_M  ((LEDC_CH3_FADE_PARAM_SCALE_V)<<(LEDC_CH3_FADE_PARAM_SCALE_S))
#define LEDC_CH3_FADE_PARAM_SCALE_V  0x3FF
#define LEDC_CH3_FADE_PARAM_SCALE_S  11
/* LEDC_CH3_FADE_PARAM_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_FADE_PARAM_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_FADE_PARAM_DUTY_CYCLE_M  ((LEDC_CH3_FADE_PARAM_DUTY_CYCLE_V)<<(LEDC_CH3_FADE_PARAM_DUTY_CYCLE_S))
#define LEDC_CH3_FADE_PARAM_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_FADE_PARAM_DUTY_CYCLE_S  1
/* LEDC_CH3_FADE_PARAM_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_FADE_PARAM_DUTY_INC    (BIT(0))
#define LEDC_CH3_FADE_PARAM_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_FADE_PARAM_DUTY_INC_V  0x1
#define LEDC_CH3_FADE_PARAM_DUTY_INC_S  0


#define LEDC_CH4_FADE_PARAM_REG  (DR_REG_LEDC_BASE + 0x500)
/* LEDC_CH4_FADE_PARAM_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH4_FADE_PARAM_DUTY_NUM    0x000003FF
#define LEDC_CH4_FADE_PARAM_DUTY_NUM_M  ((LEDC_CH4_FADE_PARAM_DUTY_NUM_V)<<(LEDC_CH4_FADE_PARAM_DUTY_NUM_S))
#define LEDC_CH4_FADE_PARAM_DUTY_NUM_V  0x3FF
#define LEDC_CH4_FADE_PARAM_DUTY_NUM_S  21
/* LEDC_CH4_FADE_PARAM_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH4_FADE_PARAM_SCALE    0x000003FF
#define LEDC_CH4_FADE_PARAM_SCALE_M  ((LEDC_CH4_FADE_PARAM_SCALE_V)<<(LEDC_CH4_FADE_PARAM_SCALE_S))
#define LEDC_CH4_FADE_PARAM_SCALE_V  0x3FF
#define LEDC_CH4_FADE_PARAM_SCALE_S  11
/* LEDC_CH4_FADE_PARAM_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH4_FADE_PARAM_DUTY_CYCLE    0x000003FF
#define LEDC_CH4_FADE_PARAM_DUTY_CYCLE_M  ((LEDC_CH4_FADE_PARAM_DUTY_CYCLE_V)<<(LEDC_CH4_FADE_PARAM_DUTY_CYCLE_S))
#define LEDC_CH4_FADE_PARAM_DUTY_CYCLE_V  0x3FF
#define LEDC_CH4_FADE_PARAM_DUTY_CYCLE_S  1
/* LEDC_CH4_FADE_PARAM_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH4_FADE_PARAM_DUTY_INC    (BIT(0))
#define LEDC_CH4_FADE_PARAM_DUTY_INC_M  (BIT(0))
#define LEDC_CH4_FADE_PARAM_DUTY_INC_V  0x1
#define LEDC_CH4_FADE_PARAM_DUTY_INC_S  0


#define LEDC_CH5_FADE_PARAM_REG  (DR_REG_LEDC_BASE + 0x540)
/* LEDC_CH5_FADE_PARAM_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH5_FADE_PARAM_DUTY_NUM    0x000003FF
#define LEDC_CH5_FADE_PARAM_DUTY_NUM_M  ((LEDC_CH5_FADE_PARAM_DUTY_NUM_V)<<(LEDC_CH5_FADE_PARAM_DUTY_NUM_S))
#define LEDC_CH5_FADE_PARAM_DUTY_NUM_V  0x3FF
#define LEDC_CH5_FADE_PARAM_DUTY_NUM_S  21
/* LEDC_CH5_FADE_PARAM_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH5_FADE_PARAM_SCALE    0x000003FF
#define LEDC_CH5_FADE_PARAM_SCALE_M  ((LEDC_CH5_FADE_PARAM_SCALE_V)<<(LEDC_CH5_FADE_PARAM_SCALE_S))
#define LEDC_CH5_FADE_PARAM_SCALE_V  0x3FF
#define LEDC_CH5_FADE_PARAM_SCALE_S  11
/* LEDC_CH5_FADE_PARAM_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH5_FADE_PARAM_DUTY_CYCLE    0x000003FF
#define LEDC_CH5_FADE_PARAM_DUTY_CYCLE_M  ((LEDC_CH5_FADE_PARAM_DUTY_CYCLE_V)<<(LEDC_CH5_FADE_PARAM_DUTY_CYCLE_S))
#define LEDC_CH5_FADE_PARAM_DUTY_CYCLE_V  0x3FF
#define LEDC_CH5_FADE_PARAM_DUTY_CYCLE_S  1
/* LEDC_CH5_FADE_PARAM_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH5_FADE_PARAM_DUTY_INC    (BIT(0))
#define LEDC_CH5_FADE_PARAM_DUTY_INC_M  (BIT(0))
#define LEDC_CH5_FADE_PARAM_DUTY_INC_V  0x1
#define LEDC_CH5_FADE_PARAM_DUTY_INC_S  0


#define LEDC_CH6_FADE_PARAM_REG  (DR_REG_LEDC_BASE + 0x580)
/* LEDC_CH6_FADE_PARAM_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH6_FADE_PARAM_DUTY_NUM    0x000003FF
#define LEDC_CH6_FADE_PARAM_DUTY_NUM_M  ((LEDC_CH6_FADE_PARAM_DUTY_NUM_V)<<(LEDC_CH6_FADE_PARAM_DUTY_NUM_S))
#define LEDC_CH6_FADE_PARAM_DUTY_NUM_V  0x3FF
#define LEDC_CH6_FADE_PARAM_DUTY_NUM_S  21
/* LEDC_CH6_FADE_PARAM_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH6_FADE_PARAM_SCALE    0x000003FF
#define LEDC_CH6_FADE_PARAM_SCALE_M  ((LEDC_CH6_FADE_PARAM_SCALE_V)<<(LEDC_CH6_FADE_PARAM_SCALE_S))
#define LEDC_CH6_FADE_PARAM_SCALE_V  0x3FF
#define LEDC_CH6_FADE_PARAM_SCALE_S  11
/* LEDC_CH6_FADE_PARAM_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH6_FADE_PARAM_DUTY_CYCLE    0x000003FF
#define LEDC_CH6_FADE_PARAM_DUTY_CYCLE_M  ((LEDC_CH6_FADE_PARAM_DUTY_CYCLE_V)<<(LEDC_CH6_FADE_PARAM_DUTY_CYCLE_S))
#define LEDC_CH6_FADE_PARAM_DUTY_CYCLE_V  0x3FF
#define LEDC_CH6_FADE_PARAM_DUTY_CYCLE_S  1
/* LEDC_CH6_FADE_PARAM_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH6_FADE_PARAM_DUTY_INC    (BIT(0))
#define LEDC_CH6_FADE_PARAM_DUTY_INC_M  (BIT(0))
#define LEDC_CH6_FADE_PARAM_DUTY_INC_V  0x1
#define LEDC_CH6_FADE_PARAM_DUTY_INC_S  0


#define LEDC_CH7_FADE_PARAM_REG  (DR_REG_LEDC_BASE + 0x5c0)
/* LEDC_CH7_FADE_PARAM_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH7_FADE_PARAM_DUTY_NUM    0x000003FF
#define LEDC_CH7_FADE_PARAM_DUTY_NUM_M  ((LEDC_CH7_FADE_PARAM_DUTY_NUM_V)<<(LEDC_CH7_FADE_PARAM_DUTY_NUM_S))
#define LEDC_CH7_FADE_PARAM_DUTY_NUM_V  0x3FF
#define LEDC_CH7_FADE_PARAM_DUTY_NUM_S  21
/* LEDC_CH7_FADE_PARAM_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH7_FADE_PARAM_SCALE    0x000003FF
#define LEDC_CH7_FADE_PARAM_SCALE_M  ((LEDC_CH7_FADE_PARAM_SCALE_V)<<(LEDC_CH7_FADE_PARAM_SCALE_S))
#define LEDC_CH7_FADE_PARAM_SCALE_V  0x3FF
#define LEDC_CH7_FADE_PARAM_SCALE_S  11
/* LEDC_CH7_FADE_PARAM_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH7_FADE_PARAM_DUTY_CYCLE    0x000003FF
#define LEDC_CH7_FADE_PARAM_DUTY_CYCLE_M  ((LEDC_CH7_FADE_PARAM_DUTY_CYCLE_V)<<(LEDC_CH7_FADE_PARAM_DUTY_CYCLE_S))
#define LEDC_CH7_FADE_PARAM_DUTY_CYCLE_V  0x3FF
#define LEDC_CH7_FADE_PARAM_DUTY_CYCLE_S  1
/* LEDC_CH7_FADE_PARAM_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH7_FADE_PARAM_DUTY_INC    (BIT(0))
#define LEDC_CH7_FADE_PARAM_DUTY_INC_M  (BIT(0))
#define LEDC_CH7_FADE_PARAM_DUTY_INC_V  0x1
#define LEDC_CH7_FADE_PARAM_DUTY_INC_S  0

#ifdef __cplusplus
}
#endif
